nhattruong05022003/peaks_stm32/lib/stm32f1xxx.h
#ifndef _STM32F1XXX_H_
#define _STM32F1XXX_H_

#include <stdint.h>
#include "cortex_m3.h"
/**********************************************************************************************************************
 *                                                      RCC
 **********************************************************************************************************************/
typedef struct RCC_Type_t
{   
    /* Clock control registe (CR) 0x00 */
    union
    {
        volatile uint32_t CR;
        struct
        {
            volatile uint32_t HSION : 1;
            volatile uint32_t HSIRDY : 1;
            volatile const uint32_t : 1;
            volatile uint32_t HSITRIM : 5;
            volatile uint32_t HSICAL : 8;
            volatile uint32_t HSEON : 1;
            volatile uint32_t HSERDY : 1;
            volatile uint32_t HSEBYP : 1;
            volatile uint32_t CSSON : 1;
            volatile const uint32_t : 4;
            volatile uint32_t PLLON : 1;
            volatile uint32_t PLLRDY : 1;
            volatile uint32_t PLL2ON : 1;
            volatile uint32_t PLL2RDY : 1;
            volatile uint32_t PLL3ON : 1;
            volatile uint32_t PLL3RDY : 1;
            volatile const uint32_t : 2;
        } CR_b;
    };

    /* Clock configuration registe (CFGR) 0x04 */
    union
    {
        volatile uint32_t CFGR;
        struct
        {
            volatile uint32_t SW : 2;
            volatile uint32_t SWS : 2;
            volatile uint32_t HPRE : 4;
            volatile uint32_t PPRE1 : 3;
            volatile uint32_t PPRE2 : 3;
            volatile uint32_t ADCPRE : 2;
            volatile uint32_t PLLSRC : 1;
            volatile uint32_t PLLXTPRE : 1;
            volatile uint32_t PLLMUL : 4;
            volatile uint32_t OTGFSPRE : 1;
            volatile const uint32_t : 1;
            volatile uint32_t MCO : 4;
            volatile const uint32_t : 4;
        } CFGR_b;
    };

    /* Clock interrupt register (CIR) 0x08 */
    union
    {
        volatile uint32_t CIR;
        struct
        {
            volatile uint32_t LSIRDYF : 1;
            volatile uint32_t LSERDYF : 1;
            volatile uint32_t HSIRDYF : 1;
            volatile uint32_t HSERDYF : 1;
            volatile uint32_t PLLRDYF : 1;
            volatile uint32_t PLL2RDYF : 1;
            volatile uint32_t PLL3RDYF : 1;
            volatile uint32_t CSSF : 1;
            volatile uint32_t LSIRDYIE : 1;
            volatile uint32_t LSERDYIE : 1;
            volatile uint32_t HSIRDYIE : 1;
            volatile uint32_t HSERDYIE : 1;
            volatile uint32_t PLLRDYIE : 1;
            volatile uint32_t PLL2RDYIE : 1;
            volatile uint32_t PLL3RDYIE : 1;
            volatile const uint32_t : 1;
            volatile uint32_t LSIRDYC : 1;
            volatile uint32_t LSERDYC : 1;
            volatile uint32_t HSIRDYC : 1;
            volatile uint32_t HSERDYC : 1;
            volatile uint32_t PLLRDYC : 1;
            volatile uint32_t PLL2RDYC : 1;
            volatile uint32_t PLL3RDYC : 1;
            volatile uint32_t CSSC : 1;
            volatile const uint32_t : 8;
        } CIR_b;
    };


    /* APB2 peripheral reset register (APB2RSTR) 0x0C */
    union
    {
        volatile uint32_t APB2RSTR;
        struct
        {
            volatile uint32_t AFIORST : 1;
            volatile const uint32_t  : 1;
            volatile uint32_t IOPARST : 1;
            volatile uint32_t IOPBRST : 1;
            volatile uint32_t IOPCRST : 1;
            volatile uint32_t IOPDRST : 1;
            volatile uint32_t IOPERST : 1;
            volatile const uint32_t : 2;
            volatile uint32_t ADC1RST : 1;
            volatile uint32_t ADC2RST : 1;
            volatile uint32_t TIM1RST : 1;
            volatile uint32_t SPI1RST : 1;
            volatile const uint32_t REVERSED2 : 1;
            volatile uint32_t USART1RST : 1;
            volatile const uint32_t : 17;
        } APB2RSTR_b;
    };

    /* APB1 peripheral reset register (APB1RSTR) 0x10 */
    union
    {
        volatile uint32_t APB1RSTR;
        struct
        {
            volatile uint32_t AFITIM2RSTORST : 1;
            volatile uint32_t TIM3RST : 1;
            volatile uint32_t TIM4RST : 1;
            volatile uint32_t TIM5RST : 1;
            volatile uint32_t TIM6RST : 1;
            volatile uint32_t TIM7RST : 1;
            volatile const uint32_t  : 5;
            volatile uint32_t WWDGRST : 1;
            volatile const uint32_t  : 2;
            volatile uint32_t SPI2RST : 1;
            volatile uint32_t SPI3RST : 1;
            volatile const uint32_t REVERSED2 : 1;
            volatile uint32_t USART2RST : 1;
            volatile uint32_t USART3RST : 1;
            volatile uint32_t UART4RST : 1;
            volatile uint32_t UART5RST : 1;
            volatile uint32_t I2C1RST : 1;
            volatile uint32_t I2C2RST : 1;
            volatile const uint32_t : 2;
            volatile uint32_t CAN1RST : 1;
            volatile uint32_t CAN2RST : 1;
            volatile uint32_t BKPRST : 1;
            volatile uint32_t PWRRST : 1;
            volatile uint32_t DACRST : 1;
            volatile const uint32_t : 2;
        } APB1RSTR_b;
    };

    /* AHB Peripheral Clock enable register (AHBENR) 0x14 */
    union
    {
        volatile uint32_t AHBENR;
        struct
        {
            volatile uint32_t DMA1EN : 1;
            volatile uint32_t DMA2EN : 1;
            volatile uint32_t SRAMEN : 1;
            volatile const uint32_t  : 1;
            volatile uint32_t FLITFEN : 1;
            volatile const uint32_t  : 1;
            volatile uint32_t CRCEN : 1;
            volatile const uint32_t REVERSED2 : 5;
            volatile uint32_t OTGFSEN : 1;
            volatile const uint32_t : 1;
            volatile uint32_t ETHMACEN : 1;
            volatile uint32_t ETHMACTXEN : 1;
            volatile uint32_t ETHMACRXEN : 1;
            volatile const uint32_t : 15;
        } AHBENR_b;
    };

    /* APB2 peripheral clock enable register (APB2ENR) 0x18 */
    union
    {
        volatile uint32_t APB2ENR;
        struct
        {
            volatile uint32_t AFIOEN : 1;
            volatile const uint32_t  : 1;
            volatile uint32_t IOPAEN : 1;
            volatile uint32_t IOPBEN : 1;
            volatile uint32_t IOPCEN : 1;
            volatile uint32_t IOPDEN : 1;
            volatile uint32_t IOPEEN : 1;
            volatile const uint32_t  : 2;
            volatile uint32_t ADC1EN : 1;
            volatile uint32_t ADC2EN : 1;
            volatile uint32_t TIM1EN : 1;
            volatile uint32_t SPI1EN : 1;
            volatile const uint32_t REVERSED2 : 1;
            volatile uint32_t USART1EN : 1;
            volatile const uint32_t : 17;
        } APB2ENR_b;
    };

    /* APB1 peripheral clock enable register (APB1ENR) 0x1C */
    union
    {
        volatile uint32_t APB1ENR;
        struct
        {
            volatile uint32_t TIM2EN : 1;
            volatile uint32_t TIM3EN : 1;
            volatile uint32_t TIM4EN : 1;
            volatile uint32_t TIM5EN : 1;
            volatile uint32_t TIM6EN : 1;
            volatile uint32_t TIM7EN : 1;
            volatile const uint32_t  : 5;
            volatile uint32_t WWDGEN : 1;
            volatile const uint32_t  : 2;
            volatile uint32_t SPI2EN : 1;
            volatile uint32_t SPI3EN : 1;
            volatile const uint32_t REVERSED2 : 1;
            volatile uint32_t USART2EN : 1;
            volatile uint32_t USART3EN : 1;
            volatile uint32_t UART4EN : 1;
            volatile uint32_t UART5EN : 1;
            volatile uint32_t I2C1EN : 1;
            volatile uint32_t I2C2EN : 1;
            volatile const uint32_t : 2;
            volatile uint32_t CAN1EN : 1;
            volatile uint32_t CAN2EN : 1;
            volatile uint32_t BKPEN : 1;
            volatile uint32_t PWREN : 1;
            volatile uint32_t DACEN : 1;
            volatile const uint32_t : 2;
        } APB1ENR_b;
    };

    /* Backup domain control register (BDCR) 0x20 */
    union
    {
        volatile uint32_t BDCR;
        struct
        {
            volatile uint32_t LSEON : 1;
            volatile uint32_t LSERDY : 1;
            volatile uint32_t LSEBYP : 1;
            volatile const uint32_t  : 5;
            volatile uint32_t RTCSEL : 2;
            volatile const uint32_t  : 5;
            volatile uint32_t RTCEN : 1;
            volatile uint32_t BDRST : 1;
            volatile const uint32_t REVERSED2 : 15;
        } BDCR_b;
    };

    /* Control/status register (CSR) 0x24 */
    union
    {
        volatile uint32_t CSR;
        struct
        {
            volatile uint32_t LSION : 1;
            volatile uint32_t LSIRDY : 1;
            volatile const uint32_t  : 22;
            volatile uint32_t RMVF : 1;
            volatile const uint32_t  : 1;
            volatile uint32_t PINRSTF : 1;
            volatile uint32_t PORRSTF : 1;
            volatile uint32_t SFTRSTF : 1;
            volatile uint32_t IWDGRSTF : 1;
            volatile uint32_t WWDGRSTF : 1;
            volatile uint32_t LPWRRSTF : 1;
            volatile const uint32_t REVERSED2 : 15;
        } CSR_b;
    };

    /* AHB peripheral clock reset register (AHBRSTR) 0x28 */
    union
    {
        volatile uint32_t AHBRSTR;
        struct
        {
            volatile uint32_t LSION : 1;
            volatile uint32_t LSIRDY : 1;
            volatile const uint32_t  : 22;
            volatile uint32_t RMVF : 1;
            volatile const uint32_t  : 1;
            volatile uint32_t PINRSTF : 1;
            volatile uint32_t PORRSTF : 1;
            volatile uint32_t SFTRSTF : 1;
            volatile uint32_t IWDGRSTF : 1;
            volatile uint32_t WWDGRSTF : 1;
            volatile uint32_t LPWRRSTF : 1;
            volatile const uint32_t REVERSED2 : 15;
        } AHBRSTR_b;
    };

    /* Clock configuration register2 (CFGR2) 0x2C */
    union
    {
        volatile uint32_t CFGR2;
        struct
        {
            volatile uint32_t PREDIV1 : 4;
            volatile uint32_t PREDIV2 : 4;
            volatile uint32_t PLL2MUL : 4;
            volatile uint32_t PLL3MUL : 4;
            volatile uint32_t PREDIV1SRC : 1;
            volatile uint32_t I2S2SRC : 1;
            volatile uint32_t I2S3SRC : 4;
            volatile const uint32_t  : 13;
        } CFGR2_b;
    };
} RCC_Type;

#define RCC_BASE        (0x40021000U)
#define RCC ((RCC_Type *)RCC_BASE)

/**********************************************************************************************************************
 *                                                      GPIO
 **********************************************************************************************************************/
typedef struct GPIOx_Type_t
{   
    /* Port configuration register low (CRL) 0x00 */
    union
    {
        volatile uint32_t CRL;
        struct
        {
            volatile uint32_t MODE0 : 2;
            volatile uint32_t CNF0 : 2;
            volatile uint32_t MODE1 : 2;
            volatile uint32_t CNF1 : 2;
            volatile uint32_t MODE2 : 2;
            volatile uint32_t CNF2 : 2;
            volatile uint32_t MODE3 : 2;
            volatile uint32_t CNF3 : 2;
            volatile uint32_t MODE4 : 2;
            volatile uint32_t CNF4 : 2;
            volatile uint32_t MODE5 : 2;
            volatile uint32_t CNF5 : 2;
            volatile uint32_t MODE6 : 2;
            volatile uint32_t CNF6 : 2;
            volatile uint32_t MODE7 : 2;
            volatile uint32_t CNF7 : 2;
        } CRL_b;
    };

    /* Port configuration register high (CRH) 0x04 */
    union
    {
        volatile uint32_t CRH;
        struct
        {
            volatile uint32_t MODE8 : 2;
            volatile uint32_t CNF8 : 2;
            volatile uint32_t MODE9 : 2;
            volatile uint32_t CNF9 : 2;
            volatile uint32_t MODE10 : 2;
            volatile uint32_t CNF10 : 2;
            volatile uint32_t MODE11 : 2;
            volatile uint32_t CNF11 : 2;
            volatile uint32_t MODE12 : 2;
            volatile uint32_t CNF12 : 2;
            volatile uint32_t MODE13 : 2;
            volatile uint32_t CNF13 : 2;
            volatile uint32_t MODE14 : 2;
            volatile uint32_t CNF14 : 2;
            volatile uint32_t MODE15 : 2;
            volatile uint32_t CNF15 : 2;
        } CRH_b;
    };

