nhattruong05022003/peaks_stm32/lib/stm32f1xxx.h
    /* Port input data register (IDR) 0x08 */
    union
    {
        volatile uint32_t IDR;
        struct
        {
            volatile const uint32_t IDR0 : 1;
            volatile const uint32_t IDR1 : 1;
            volatile const uint32_t IDR2 : 1;
            volatile const uint32_t IDR3 : 1;
            volatile const uint32_t IDR4 : 1;
            volatile const uint32_t IDR5 : 1;
            volatile const uint32_t IDR6 : 1;
            volatile const uint32_t IDR7 : 1;
            volatile const uint32_t IDR8 : 1;
            volatile const uint32_t IDR9 : 1;
            volatile const uint32_t IDR10 : 1;
            volatile const uint32_t IDR11 : 1;
            volatile const uint32_t IDR12 : 1;
            volatile const uint32_t IDR13 : 1;
            volatile const uint32_t IDR14 : 1;
            volatile const uint32_t IDR15 : 1;
            volatile const uint32_t  : 16;
        } IDR_b;
    };

    /* Port output data register (ODR) 0x0C */
    union
    {
        volatile uint32_t ODR;
        struct
        {
            volatile uint32_t ODR0 : 1;
            volatile uint32_t ODR1 : 1;
            volatile uint32_t ODR2 : 1;
            volatile uint32_t ODR3 : 1;
            volatile uint32_t ODR4 : 1;
            volatile uint32_t ODR5 : 1;
            volatile uint32_t ODR6 : 1;
            volatile uint32_t ODR7 : 1;
            volatile uint32_t ODR8 : 1;
            volatile uint32_t ODR9 : 1;
            volatile uint32_t ODR10 : 1;
            volatile uint32_t ODR11 : 1;
            volatile uint32_t ODR12 : 1;
            volatile uint32_t ODR13 : 1;
            volatile uint32_t ODR14 : 1;
            volatile uint32_t ODR15 : 1;
            volatile const uint32_t  : 16;
        } ODR_b;
    };

    /* Port bit set/reset register (BSRR) 0x10 */
    union
    {
        volatile uint32_t BSRR;
        struct
        {
            volatile uint32_t BS0 : 1;
            volatile uint32_t BS1 : 1;
            volatile uint32_t BS2 : 1;
            volatile uint32_t BS3 : 1;
            volatile uint32_t BS4 : 1;
            volatile uint32_t BS5 : 1;
            volatile uint32_t BS6 : 1;
            volatile uint32_t BS7 : 1;
            volatile uint32_t BS8 : 1;
            volatile uint32_t BS9 : 1;
            volatile uint32_t BS10 : 1;
            volatile uint32_t BS11 : 1;
            volatile uint32_t BS12 : 1;
            volatile uint32_t BS13 : 1;
            volatile uint32_t BS14 : 1;
            volatile uint32_t BS15 : 1;
            volatile uint32_t BR0 : 1;
            volatile uint32_t BR1 : 1;
            volatile uint32_t BR2 : 1;
            volatile uint32_t BR3 : 1;
            volatile uint32_t BR4 : 1;
            volatile uint32_t BR5 : 1;
            volatile uint32_t BR6 : 1;
            volatile uint32_t BR7 : 1;
            volatile uint32_t BR8 : 1;
            volatile uint32_t BR9 : 1;
            volatile uint32_t BR10 : 1;
            volatile uint32_t BR11 : 1;
            volatile uint32_t BR12 : 1;
            volatile uint32_t BR13 : 1;
            volatile uint32_t BR14 : 1;
            volatile uint32_t BR15 : 1;
        } BSRR_b;
    };

    /* Port bit reset register (BRR) 0x14 */
    union
    {
        volatile uint32_t BRR;
        struct
        {
            volatile uint32_t BR0 : 1;
            volatile uint32_t BR1 : 1;
            volatile uint32_t BR2 : 1;
            volatile uint32_t BR3 : 1;
            volatile uint32_t BR4 : 1;
            volatile uint32_t BR5 : 1;
            volatile uint32_t BR6 : 1;
            volatile uint32_t BR7 : 1;
            volatile uint32_t BR8 : 1;
            volatile uint32_t BR9 : 1;
            volatile uint32_t BR10 : 1;
            volatile uint32_t BR11 : 1;
            volatile uint32_t BR12 : 1;
            volatile uint32_t BR13 : 1;
            volatile uint32_t BR14 : 1;
            volatile uint32_t BR15 : 1;
            volatile const uint32_t  : 16;
        } BRR_b;
    };

    /* Port configuration lock register (LCKR) 0x18 */
    /*
        This register is used to lock the configuration of the port bits when a correct write sequence
        is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the
        GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the
        LOCK sequence has been applied on a port bit it is no longer possible to modify the value of
        the port bit until the next reset.
        Each lock bit freezes the corresponding 4 bits of the control register (CRL, CRH).
    */
    union
    {
        volatile uint32_t LCKR;
        struct
        {
            volatile uint32_t LCK0 : 1;
            volatile uint32_t LCK1 : 1;
            volatile uint32_t LCK2 : 1;
            volatile uint32_t LCK3 : 1;
            volatile uint32_t LCK4 : 1;
            volatile uint32_t LCK5 : 1;
            volatile uint32_t LCK6 : 1;
            volatile uint32_t LCK7 : 1;
            volatile uint32_t LCK8 : 1;
            volatile uint32_t LCK9 : 1;
            volatile uint32_t LCK10 : 1;
            volatile uint32_t LCK11 : 1;
            volatile uint32_t LCK12 : 1;
            volatile uint32_t LCK13 : 1;
            volatile uint32_t LCK14 : 1;
            volatile uint32_t LCK15 : 1;
            volatile uint32_t LCKK : 1;
            /*
            LOCK key writing sequence:
            Write 1
            Write 0
            Write 1
            Read 0
            Read 1 (this read is optional but confirms that the lock is active)
            */
           volatile const uint32_t  : 15;
        } LCKR_b;
    };
} GPIOx_Type;

typedef struct AFIO_Type_t
{
    /* Event control register (EVCR) 0x00 */
    union
    {
        volatile uint32_t EVCR;
        struct
        {
            volatile uint32_t PIN : 4;
            volatile uint32_t PORT : 4;
            volatile uint32_t EVOE : 1;
            volatile const uint32_t : 23;
        } EVCR_b;
    };

    /* AF remap and debug I/O configuration register (MAPR) 0x04 */
    union
    {
        volatile uint32_t MAPR;
        struct
        {
            volatile uint32_t SPI1_REMAP : 1;
            volatile uint32_t I2C1_REMAP : 1;
            volatile uint32_t USART1_REMAP : 1;
            volatile uint32_t USART2_REMAP : 1;
            volatile uint32_t USART3_REMAP : 2;
            volatile uint32_t TIM1_REMAP : 2;
            volatile uint32_t TIM2_REMAP : 2;
            volatile uint32_t TIM3_REMAP : 2;
            volatile uint32_t TIM4_REMAP : 1;
            volatile uint32_t CAN_REMAP : 2;
            volatile uint32_t PD01_REMAP : 1;
            volatile uint32_t TIM5CH4_IREMAP : 1;
            volatile uint32_t ADC1_ETRGINJ_REMAP : 1;
            volatile uint32_t ADC1_ETRGREG_REMAP : 1;
            volatile uint32_t ADC2_ETRGINJ_REMAP : 1;
            volatile uint32_t ADC2_ETRGREG_REMAP : 1;
            volatile const uint32_t : 3;
            volatile uint32_t SWJ_CFG : 3;
            volatile const uint32_t : 5;
        } MAPR_b;
    };

