nhattruong05022003/peaks_stm32/lib/stm32f1xxx.h
    /* External interrupt configuration register 1 (EXTICR1) 0x08 */
    union
    {
        volatile uint32_t EXTICR1;
        struct
        {
            volatile uint32_t EXTI0 : 4;
            volatile uint32_t EXTI1 : 4;
            volatile uint32_t EXTI2 : 4;
            volatile uint32_t EXTI3 : 4;
            volatile const uint32_t : 16;
        } EXTICR1_b;
    };

    /* External interrupt configuration register 2 (EXTICR2) 0x0C */
    union
    {
        volatile uint32_t EXTICR2;
        struct
        {
            volatile uint32_t EXTI4 : 4;
            volatile uint32_t EXTI5 : 4;
            volatile uint32_t EXTI6 : 4;
            volatile uint32_t EXTI7 : 4;
            volatile const uint32_t : 16;
        } EXTICR2_b;
    };

    /* External interrupt configuration register 3 (EXTICR3) 0x10 */
    union
    {
        volatile uint32_t EXTICR3;
        struct
        {
            volatile uint32_t EXTI8 : 4;
            volatile uint32_t EXTI9 : 4;
            volatile uint32_t EXTI10 : 4;
            volatile uint32_t EXTI11 : 4;
            volatile const uint32_t : 16;
        } EXTICR3_b;
    };

    /* External interrupt configuration register 4 (EXTICR4) 0x14 */
    union
    {
        volatile uint32_t EXTICR4;
        struct
        {
            volatile uint32_t EXTI12 : 4;
            volatile uint32_t EXTI13 : 4;
            volatile uint32_t EXTI14 : 4;
            volatile uint32_t EXTI15 : 4;
            volatile const uint32_t : 16;
        } EXTICR4_b;
    };

    volatile const uint32_t RESERVED0; // 0x18

    /* AF remap and debug I/O configuration register2 (MAPR2) 0x1C */
    union
    {
        volatile uint32_t MAPR2;
        struct
        {
            volatile const uint32_t : 5;
            volatile uint32_t TIM9_REMAP : 1;
            volatile uint32_t TIM10_REMAP : 1;
            volatile uint32_t TIM11_REMAP : 1;
            volatile uint32_t TIM13_REMAP : 1;
            volatile uint32_t TIM14_REMAP : 1;
            volatile uint32_t FSMC_NADV : 1;
            volatile const uint32_t : 11;
        } MAPR2_b;
    };
} AFIO_Type;

#define GPIOA_BASE        (0x40010800U)
#define GPIOB_BASE        (0x40010C00U)
#define GPIOC_BASE        (0x40011000U)
#define GPIOD_BASE        (0x40011400U)
#define GPIOE_BASE        (0x40011800U)
#define GPIOF_BASE        (0x40011C00U)
#define GPIOG_BASE        (0x40012000U)
#define AFIO_BASE         (0x40010000U)

#define GPIOA ((GPIOx_Type *)GPIOA_BASE)
#define GPIOB ((GPIOx_Type *)GPIOB_BASE)
#define GPIOC ((GPIOx_Type *)GPIOC_BASE)
#define GPIOD ((GPIOx_Type *)GPIOD_BASE)
#define GPIOE ((GPIOx_Type *)GPIOE_BASE)
#define GPIOF ((GPIOx_Type *)GPIOF_BASE)
#define GPIOG ((GPIOx_Type *)GPIOG_BASE)
#define AFIO  ((AFIO_Type *)AFIO_BASE)

/**********************************************************************************************************************
 *                                                      PWR
 **********************************************************************************************************************/
typedef struct PWR_Type_t
{
    /* Power control register (PWR_CR) 0x00 */
    union
    {
        volatile uint32_t CR;
        struct
        {
            volatile uint32_t LPDS : 1; /* Low-power deepsleep.
                                        This bit is set and cleared by software. 
                                        It works together with the PDDS bit.
                                        0: Voltage regulator on during Stop mode
                                        1: Voltage regulator in low-power mode during Stop mode */
            volatile uint32_t PDDS : 1; /* Power down deepsleep.
                                        This bit is set and cleared by software. 
                                        It works together with the LPDS bit.
                                        0: Enter Stop mode when the CPU enters Deepsleep. 
                                        The regulator status depends on the
                                        LPDS bit.
                                        1: Enter Standby mode when the CPU enters Deepsleep. */
            volatile uint32_t CWUF : 1; /* Clear wakeup flag.
                                        This bit is always read as 0.
                                        0: No effect
                                        1: Clear the WUF Wakeup Flag after 
                                        2 System clock cycles. (write) */
            volatile uint32_t CSBF : 1; /* Clear standby flag.
                                        This bit is always read as 0.
                                        0: No effect
                                        1: Clear the SBF Standby Flag (write) */
            volatile uint32_t PVDE : 1; /* programmable voltage detector enable.
                                        This bit is set and cleared by software.
                                        0: PVD disabled
                                        1: PVD enabled */
            volatile uint32_t PLS : 3; /* PVD level selection.
                                        These bits are written by software to select the voltage threshold detected by the
                                        programmable voltage detector */
            volatile uint32_t DBP : 1; /* Disable backup domain write protection.
                                        In reset state, the RTC and backup registers 
                                        are protected against parasitic write access.
                                        This bit must be set to enable write access to 
                                        these registers.
                                        0: Access to RTC and Backup registers disabled
                                        1: Access to RTC and Backup registers enabled */
            const volatile uint32_t : 23;
        } CR_b;
    };

    /* Power control/status register (PWR_CSR) 0x04. */
    union
    {
        volatile uint32_t CSR;
        struct
        {
            const volatile uint32_t WUF : 1; /* This bit is set by hardware and cleared by hardware, 
                                        by a system reset or by setting the
                                        CWUF bit in the Power control register (PWR_CR)
                                        0: No wakeup event occurred
                                        1: A wakeup event was received from the WKUP pin or 
                                        from the RTC alarm */
            const volatile uint32_t SBF : 1; /* This bit is set by hardware and cleared only 
                                                by a POR/PDR (power on reset/power down reset)
                                                or by setting the CSBF bit in the Power control 
                                                register (PWR_CR)
                                                0: Device has not been in Standby mode
                                                1: Device has been in Standby mode */
            volatile uint32_t PVDO : 1; /* This bit is set and cleared by hardware. 
                                        It is valid only if PVD is enabled by the PVDE bit.
                                        0: VDD/VDDA is higher than the PVD threshold 
                                        selected with the PLS[2:0] bits.
                                        1: VDD/VDDA is lower than the PVD threshold 
                                        selected with the PLS[2:0] bits. */
            volatile uint32_t : 5;
            volatile uint32_t EWUP : 1; /* This bit is set and cleared by software.
                                        0: WKUP pin is used for general purpose I/O. 
                                        An event on the WKUP pin does not wakeup
                                        the device from Standby mode.
                                        1: WKUP pin is used for wakeup from Standby mode and 
                                        forced in input pull down
                                        configuration (rising edge on WKUP pin wakes-up 
                                        the system from Standby mode). */
            volatile uint32_t : 23;
        } CSR_b;
    };
} PWR_Type;

#define PWR_BASE        (0x40007000U)

#define PWR ((PWR_Type *)PWR_BASE)

/**********************************************************************************************************************
 *                                                      DMA
 **********************************************************************************************************************/

typedef struct DMAx_Config_t
{
    /* DMA channel x configuration register (DMA_CCRx) */
    union
    {
        volatile uint32_t CCRx;
        struct
        {
            volatile uint32_t EN : 1; /*  Channel enable */
            volatile uint32_t TCIE : 1; /* Transfer complete interrupt enable */
            volatile uint32_t HTIE : 1; /* Half transfer interrupt enable */
            volatile uint32_t TEIE : 1; /* Transfer error interrupt enable */
            volatile uint32_t DIR : 1; /* Data transfer direction 
                                        0: Read from peripheral
                                        1: Read from memory*/
            volatile uint32_t CIRC : 1; /* Circular mode */
            volatile uint32_t PINC : 1; /* Peripheral increment mode */
            volatile uint32_t MINC : 1; /* Memory increment mode */
            volatile uint32_t PSIZE : 2; /* Peripheral size 
                                            00: 8-bits
                                            01: 16-bits
                                            10: 32-bits
                                            11: Reserved */
            volatile uint32_t MSIZE : 2; /* Memory size
                                            00: 8-bits
                                            01: 16-bits
                                            10: 32-bits
                                            11: Reserved */
            volatile uint32_t PL : 2;   /*  Channel priority level 
                                            00: Low
                                            01: Medium
                                            10: High
                                            11: Very high */
            volatile uint32_t MEM2MEM : 1; /* Memory to memory mode */
            const volatile uint32_t : 17;
        } CCRx_b;
    };

