nhattruong05022003/peaks_stm32/lib/stm32f1xxx.h
    /* DMA channel x number of data register (DMA_CNDTRx) */
    union
    {
        /* This register can only be 
        written when the channel is disabled. Once the channel is enabled, 
        this register is read-only, indicating the remaining bytes to be transmitted. 
        This register decrements after each DMA transfer.
        Once the transfer is completed, this register can either stay at zero or be reloaded
        automatically by the value previously programmed if the channel is configured in autoreload mode.
        If this register is zero, no transaction can be served whether the channel is enabled or not.*/
        volatile uint32_t CNDTRx;
        struct
        {
            volatile uint32_t NDT : 16; /* Number of data to transfer. */
            const volatile uint32_t : 16;
        } CNDTRx_b;
    };

    /* DMA channel x peripheral address register (DMA_CPARx) */
    union
    {
        /* This register must not be written when the channel is enabled */

        volatile uint32_t CPARx;
        struct
        {
            volatile uint32_t PA : 32; /* Peripheral address. Base address of the peripheral data register 
                                          from/to which the data will be read/written. */
        } CPARx_b;
    };

    /* DMA channel x memory address register (DMA_CMARx) */
    union
    {
        /* This register must not be written when the channel is enabled */

        volatile uint32_t CMARx;
        struct
        {
            volatile uint32_t MA : 32; /* Memory address. Base address of the memory address register 
                                          from/to which the data will be read/written. */
        } CMARx_b;
    };

    const uint32_t RESERVED;
} DMAx_Config;

typedef struct DMAx_Type_t
{   
    /* DMA interrupt status register (DMA_ISR) 0x00 */
    union
    {
        const volatile uint32_t ISR;
        struct
        {
            const volatile uint32_t GIF1 : 1; /* Channel 1 global interrupt flag */
            const volatile uint32_t TCIF1 : 1; /* Channel 1 transfer complete flag */
            const volatile uint32_t HTIF1 : 1; /* Channel 1 half transfer flag */
            const volatile uint32_t TEIF1 : 1; /* Channel 1 transfer error flag */
            const volatile uint32_t GIF2 : 1; /* Channel 2 global interrupt flag */
            const volatile uint32_t TCIF2 : 1; /* Channel 2 transfer complete flag */
            const volatile uint32_t HTIF2 : 1; /* Channel 2 half transfer flag */
            const volatile uint32_t TEIF2 : 1; /* Channel 2 transfer error flag */
            const volatile uint32_t GIF3 : 1; /* Channel 3 global interrupt flag */
            const volatile uint32_t TCIF3 : 1; /* Channel 3 transfer complete flag */
            const volatile uint32_t HTIF3 : 1; /* Channel 3 half transfer flag */
            const volatile uint32_t TEIF3 : 1; /* Channel 3 transfer error flag */
            const volatile uint32_t GIF4 : 1; /* Channel 4 global interrupt flag */
            const volatile uint32_t TCIF4 : 1; /* Channel 4 transfer complete flag */
            const volatile uint32_t HTIF4 : 1; /* Channel 4 half transfer flag */
            const volatile uint32_t TEIF4 : 1; /* Channel 4 transfer error flag */
            const volatile uint32_t GIF5 : 1; /* Channel 5 global interrupt flag */
            const volatile uint32_t TCIF5 : 1; /* Channel 5 transfer complete flag */
            const volatile uint32_t HTIF5 : 1; /* Channel 5 half transfer flag */
            const volatile uint32_t TEIF5 : 1; /* Channel 5 transfer error flag */
            const volatile uint32_t GIF6 : 1; /* Channel 6 global interrupt flag */
            const volatile uint32_t TCIF6 : 1; /* Channel 6 transfer complete flag */
            const volatile uint32_t HTIF6: 1; /* Channel 6 half transfer flag */
            const volatile uint32_t TEIF6 : 1; /* Channel 6 transfer error flag */
            const volatile uint32_t GIF7 : 1; /* Channel 7 global interrupt flag */
            const volatile uint32_t TCIF7 : 1; /* Channel 7 transfer complete flag */
            const volatile uint32_t HTIF7 : 1; /* Channel 7 half transfer flag */
            const volatile uint32_t TEIF7 : 1; /* Channel 7 transfer error flag */
            const volatile uint32_t : 4;
        } ISR_b;
    };

    /* DMA interrupt flag clear register (DMA_IFCR) 0x04. Write 1 to clear */
    union
    {
        volatile uint32_t IFCR;
        struct
        {
            volatile uint32_t CGIF1 : 1; /* Channel 1 global interrupt clear */
            volatile uint32_t CTCIF1 : 1; /* Channel 1 transfer complete clear */
            volatile uint32_t CHTIF1 : 1; /* Channel 1 half transfer clear */
            volatile uint32_t CTEIF1 : 1; /* Channel 1 transfer error clear */
            volatile uint32_t CGIF2 : 1; /* Channel 2 global interrupt clear */
            volatile uint32_t CTCIF2 : 1; /* Channel 2 transfer complete clear */
            volatile uint32_t CHTIF2 : 1; /* Channel 2 half transfer clear */
            volatile uint32_t CTEIF2 : 1; /* Channel 2 transfer error clear */
            volatile uint32_t CGIF3 : 1; /* Channel 3 global interrupt clear */
            volatile uint32_t CTCIF3 : 1; /* Channel 3 transfer complete clear */
            volatile uint32_t CHTIF3 : 1; /* Channel 3 half transfer clear */
            volatile uint32_t CTEIF3 : 1; /* Channel 3 transfer error clear */
            volatile uint32_t CGIF4 : 1; /* Channel 4 global interrupt clear */
            volatile uint32_t CTCIF4 : 1; /* Channel 4 transfer complete clear */
            volatile uint32_t CHTIF4 : 1; /* Channel 4 half transfer clear */
            volatile uint32_t CTEIF4 : 1; /* Channel 4 transfer error clear */
            volatile uint32_t CGIF5 : 1; /* Channel 5 global interrupt clear */
            volatile uint32_t CTCIF5 : 1; /* Channel 5 transfer complete clear */
            volatile uint32_t CHTIF5 : 1; /* Channel 5 half transfer clear */
            volatile uint32_t CTEIF5 : 1; /* Channel 5 transfer error clear */
            volatile uint32_t CGIF6 : 1; /* Channel 6 global interrupt clear */
            volatile uint32_t CTCIF6 : 1; /* Channel 6 transfer complete clear */
            volatile uint32_t CHTIF6: 1; /* Channel 6 half transfer clear */
            volatile uint32_t CTEIF6 : 1; /* Channel 6 transfer error clear */
            volatile uint32_t CGIF7 : 1; /* Channel 7 global interrupt clear */
            volatile uint32_t CTCIF7 : 1; /* Channel 7 transfer complete clear */
            volatile uint32_t CHTIF7 : 1; /* Channel 7 half transfer clear */
            volatile uint32_t CTEIF7 : 1; /* Channel 7 transfer error clear */
            const volatile uint32_t : 4;
        } IFCR_b;
    };

    /* DMA channel x configuration register */
    DMAx_Config DMA_Channelx_Reg[7U];

} DMAx_Type;

#define DMA1_BASE        (0x40020000U)
#define DMA2_BASE        (0x40020400U)

