nhattruong05022003/peaks_stm32/lib/stm32f1xxx.h
#define DMA1 ((DMAx_Type *)DMA1_BASE)
#define DMA2 ((DMAx_Type *)DMA2_BASE)

/**********************************************************************************************************************
 *                                                      SPI
 **********************************************************************************************************************/

typedef struct SPIx_Type_t
{
    /* SPI control register 1 (SPI_CR1) (not used in I2S mode) */
    union
    {
        volatile uint32_t SPI_CR1;
        struct
        {
            volatile uint32_t CPHA : 1; /* Clock phase
                                        0: The first clock transition is the first data capture edge
                                        1: The second clock transition is the first data capture edge */
            volatile uint32_t CPOL : 1; /* Clock polarity
                                        0: CK to 0 when idle
                                        1: CK to 1 when idle */
            volatile uint32_t MSTR : 1; /* Master selection
                                        0: Slave configuration
                                        1: Master configuration */
            volatile uint32_t BR : 3; /* Baud rate control */
            volatile uint32_t SPE : 1; /* SPI enable 
                                        0: Peripheral disabled
                                        1: Peripheral enabled */
            volatile uint32_t LSBFIRST : 1; /* Frame format
                                            0: MSB transmitted first
                                            1: LSB transmitted first */
            volatile uint32_t SSI : 1; /* Internal slave select
                                        This bit has an effect only when the SSM bit is set. 
                                        The value of this bit is forced onto the
                                        NSS pin and the IO value of the NSS pin is ignored. */
            volatile uint32_t SSM : 1; /* Software slave management
                                        When the SSM bit is set, the NSS pin input is
                                        replaced with the value from the SSI bit.
                                        0: Software slave management disabled
                                        1: Software slave management enabled */
            volatile uint32_t RXONLY : 1; /* Receive only
                                            This bit combined with the BIDImode bit selects the 
                                            direction of transfer in 2-line
                                            unidirectional mode. This bit is also useful in a 
                                            multislave system in which this particular
                                            slave is not accessed, the output from the accessed 
                                            slave is not corrupted.
                                            0: Full duplex (Transmit and receive)
                                            1: Output disabled (Receive-only mode) */
            volatile uint32_t DFF : 1; /* Data frame format
                                        0: 8-bit data frame format is 
                                        selected for transmission/reception
                                        1: 16-bit data frame format is 
                                        selected for transmission/reception 
                                        This bit should be written only when SPI is 
                                        disabled (SPE = ‘0’) for correct operation */
            volatile uint32_t CRCNEXT : 1; /* CRC transfer next 
                                            0: Data phase (no CRC phase)
                                            1: Next transfer is CRC (CRC phase) 
                                            When the SPI is configured in full duplex or transmitter 
                                            only modes, CRCNEXT must be written as soon as the last 
                                            data is written to the SPI_DR register.
                                            When the SPI is configured in receiver only mode, CRCNEXT 
                                            must be set after the second last data reception. */
            volatile uint32_t CRCEN : 1; /* Hardware CRC calculation enable
                                            0: CRC calculation disabled
                                            1: CRC calculation enabled 
                                            This bit should be written only when SPI is disabled 
                                            (SPE = ‘0’) for correct operation */
            volatile uint32_t BIDIOE : 1; /* Output enable in bidirectional mode
                                            This bit combined with the BIDImode bit selects the 
                                            direction of transfer in bidirectional mode
                                            0: Output disabled (receive-only mode)
                                            1: Output enabled (transmit-only mode) 
                                            In master mode, the MOSI pin is used while the 
                                            MISO pin is used in slave mode.*/
            volatile uint32_t BIDIMODE : 1; /* Bidirectional data mode enable
                                            0: 2-line unidirectional data mode selected
                                            1: 1-line bidirectional data mode selected */
            const volatile uint32_t : 16;
        }SPI_CR1_b;
    };

    /* SPI control register 2 (SPI_CR2) */
    union
    {
        volatile uint32_t SPI_CR2;
        struct
        {
            volatile uint32_t RXDMAEN : 1; /* Rx buffer DMA enable 
                                            When this bit is set, the DMA request is made 
                                            whenever the RXNE flag is set.
                                            0: Rx buffer DMA disabled
                                            1: Rx buffer DMA enabled */
            volatile uint32_t TXDMAEN : 1; /* Tx buffer DMA enable 
                                            When this bit is set, the DMA request is made 
                                            whenever the RXNE flag is set.
                                            0: Rx buffer DMA disabled
                                            1: Rx buffer DMA enabled */
            volatile uint32_t SSOE : 1; /*  SS output enable
                                            0: SS output is disabled in master mode and the cell 
                                            can work in multimaster configuration
                                            1: SS output is enabled in master mode and when the cell is enabled. 
                                            The cell cannot work in a multimaster environment */
            const volatile uint32_t : 2;
            volatile uint32_t ERRIE : 1; /* Error interrupt enable
                                            This bit controls the generation of an interrupt when an 
                                            error condition occurs (CRCERR, OVR, MODF in SPI mode and UDR, 
                                            OVR in I2S mode).
                                            0: Error interrupt is masked
                                            1: Error interrupt is enabled */
            volatile uint32_t RXNEIE : 1; /* RX buffer not empty interrupt enable
                                            0: RXNE interrupt masked
                                            1: RXNE interrupt not masked. Used to generate 
                                            an interrupt request when the RXNE flag is
                                            set. */
            volatile uint32_t TXEIE : 1; /* Tx buffer empty interrupt enable
                                            0: TXE interrupt masked
                                            1: TXE interrupt not masked. Used to generate 
                                            an interrupt request when the TXE flag is set. */
            const volatile uint32_t : 24;
        } SPI_CR2_b;
    };

    /* SPI status register (SPI_SR) */
    union
    {
        volatile uint32_t SPI_SR;
        struct
        {
            const volatile uint32_t RXNE : 1; /* Receive buffer not empty */
            const volatile uint32_t TXE : 1; /* Transmit buffer empty */
            const volatile uint32_t CHSIDE : 1; /* CHSIDE: Channel side
                                                0: Channel Left has to be transmitted or has been received
                                                1: Channel Right has to be transmitted or has been received
                                                Note: This bit is not used for SPI mode and is 
                                                meaningless in PCM mode */
            const volatile uint32_t UDR : 1; /* Underrun flag
                                                0: No underrun occurred
                                                1: Underrun occurred
                                                This flag is set by hardware and reset by a software sequence.
                                                Note: This bit is not used in SPI mode. */
            volatile uint32_t CRCERR : 1; /* CRC error flag
                                                0: CRC value received matches the SPI_RXCRCR value
                                                1: CRC value received does not match the SPI_RXCRCR value */
            const volatile uint32_t MODF : 1; /* Mode fault
                                                0: No mode fault occurred
                                                1: Mode fault occurred
                                                This flag is set by hardware and reset by a software sequence.  */
            const volatile uint32_t OVR : 1; /* Overrun flag
                                                0: No overrun occurred
                                                1: Overrun occurred
                                                This flag is set by hardware and reset by a software sequence */
            const volatile uint32_t BSY : 1; /* Busy flag
                                                0: SPI (or I2S) not busy
                                                1: SPI (or I2S) is busy in communication or Tx buffer is not empty
                                                This flag is set and cleared by hardware. */
            const volatile uint32_t : 24;
        } SPI_SR_b;
    };

