nhattruong05022003/peaks_stm32/lib/stm32f1xxx.h
    /* SPI data register (SPI_DR) */
    union
    {
        volatile uint32_t SPI_DR;
        struct
        {
            volatile uint32_t DR : 16; /* Data register
                                        Data received or to be transmitted.
                                        The data register is split into 2 buffers - one for writing 
                                        (Transmit Buffer) and another one for reading (Receive buffer). 
                                        A write to the data register will write into the Tx buffer and a read
                                        from the data register will return the value held in the Rx buffer. */
            const volatile uint32_t : 16;
        } SPI_DR_b;
    };

    /* SPI CRC polynomial register (SPI_CRCPR) (not used in I2S mode) */
    union
    {
        volatile uint32_t SPI_CRCPR;
        struct
        {
            volatile uint32_t CRCPOLY : 16;  /* CRC polynomial register
                                                This register contains the polynomial for the CRC calculation.
                                                The CRC polynomial (0007h) is the reset value of this register. Another polynomial can be
                                                configured as required */
            const volatile uint32_t : 16;
        } SPI_CRCPR_b;
    };

    /* SPI RX CRC register (SPI_RXCRCR) (not used in I2S mode) */
    union
    {
        const volatile uint32_t SPI_RXCRCR;
        struct
        {
            const volatile uint32_t RXCRC : 16;  /* Rx CRC register
                                            When CRC calculation is enabled, the RxCRC[15:0] bits contain 
                                            the computed CRC value of the subsequently received bytes. This 
                                            register is reset when the CRCEN bit in SPI_CR1 register is written 
                                            to 1. The CRC is calculated serially using the polynomial programmed in
                                            the SPI_CRCPR register.
                                            Only the 8 LSB bits are considered when the data frame format is 
                                            set to be 8-bit data (DFF bit of SPI_CR1 is cleared). CRC calculation 
                                            is done based on any CRC8 standard.
                                            The entire 16-bits of this register are considered when a 16-bit data 
                                            frame format is selected (DFF bit of the SPI_CR1 register is set). 
                                            CRC calculation is done based on any CRC16 standard.
                                            Note: A read to this register when the BSY Flag is set could return 
                                            an incorrect value. */
            const volatile uint32_t : 16;
        } SPI_RXCRCR_b;
    };

    /* SPI TX CRC register (SPI_TXCRCR) (not used in I2S mode) */
    union
    {
        const volatile uint32_t SPI_TXCRCR;
        struct
        {
            const volatile uint32_t TXCRC : 16;    /* Tx CRC register
                                                When CRC calculation is enabled, the TxCRC[7:0] bits contain 
                                                the computed CRC value of the subsequently transmitted bytes. 
                                                This register is reset when the CRCEN bit of SPI_CR1 is written 
                                                to 1. The CRC is calculated serially using the polynomial programmed 
                                                in the SPI_CRCPR register.
                                                Only the 8 LSB bits are considered when the data frame format is set 
                                                to be 8-bit data (DFF bit of SPI_CR1 is cleared). CRC calculation is 
                                                done based on any CRC8 standard.
                                                The entire 16-bits of this register are considered when a 16-bit data 
                                                frame format is selected (DFF bit of the SPI_CR1 register is set). 
                                                CRC calculation is done based on any CRC16 standard.
                                                Note: A read to this register when the BSY flag is set could return 
                                                an incorrect value. */
            const volatile uint32_t : 16;
        } SPI_TXCRCR_b;
    };

    /* SPI_I2S configuration register (SPI_I2SCFGR) */
    union
    {
        volatile uint32_t SPI_I2SCFGR;
        struct
        {
            volatile uint32_t CHLEN : 1; /* Channel length (number of bits per audio channel)
                                            0: 16-bit wide
                                            1: 32-bit wide
                                            The bit write operation has a meaning only if DATLEN = 00 
                                            otherwise the channel length is fixed to
                                            32-bit by hardware whatever the value filled in. */
            volatile uint32_t DATLEN : 2; /* Data length to be transferred
                                            00: 16-bit data length
                                            01: 24-bit data length
                                            10: 32-bit data length
                                            11: Not allowed */
            volatile uint32_t CKPOL : 1; /* Steady state clock polarity
                                            0: I2S clock steady state is low level
                                            1: I2S clock steady state is high level */
            volatile uint32_t I2SSTD : 2; /* I2S standard selection
                                            00: I2S Philips standard.
                                            01: MSB justified standard (left justified)
                                            10: LSB justified standard (right justified)
                                            11: PCM standard */
            const volatile uint32_t : 1;
            volatile uint32_t PCMSYNC : 1; /* PCM frame synchronization
                                            0: Short frame synchronization
                                            1: Long frame synchronization
                                            Note: This bit has a meaning only if I2SSTD = 11 (PCM standard is used) */
            volatile uint32_t I2SCFG : 2; /* I2S configuration mode
                                            00: Slave - transmit
                                            01: Slave - receive
                                            10: Master - transmit
                                            11: Master - receive */
            volatile uint32_t I2SE : 1; /* I2S Enable
                                            0: I2S peripheral is disabled
                                            1: I2S peripheral is enabled */
            volatile uint32_t I2SMOD : 1; /* I2SMOD: I2S mode selection
                                            0: SPI mode is selected
                                            1: I2S mode is selecte */
            const volatile uint32_t : 20;
        }SPI_I2SCFGR_b;
    };

    /*  SPI_I2S prescaler register (SPI_I2SPR) */
    union
    {
        volatile uint32_t SPI_I2SPR;
        struct
        {
            volatile uint32_t I2SDIV : 8; /*  I2S Linear prescaler */
            volatile uint32_t ODD : 1; /* Odd factor for the prescaler
                                        0: real divider value is = I2SDIV *2
                                        1: real divider value is = (I2SDIV * 2)+1 */
            volatile uint32_t MCKOE : 1; /* Master clock output enable
                                            0: Master clock output is disabled
                                            1: Master clock output is enabled */
            const volatile uint32_t : 12;
        }SPI_I2SPR_b;
    };
} SPIx_Type;

#define SPI1_BASE        (0x40013000U)
#define SPI2_BASE        (0x40003800U)
#define SPI3_BASE        (0x40003C00U)

#define SPI1 ((SPIx_Type *)SPI1_BASE)
#define SPI2 ((SPIx_Type *)SPI2_BASE)
#define SPI3 ((SPIx_Type *)SPI3_BASE)

#endif